Revit 2027 API
RebarUpdateCurvesData.GetLayoutRule Method
 Gets the layout rule for this bar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarLayoutRule GetLayoutRule()
Public Function GetLayoutRule As RebarLayoutRule
public:
RebarLayoutRule GetLayoutRule()
member GetLayoutRule : unit -> RebarLayoutRule
Return Value
RebarLayoutRule
 Returns the layout rule for this bar.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace